# Pandas 
```
pip install pandas 
pip install --upgrade pandas
```
- Pandas Series
- Pandas DataFrame --> use various ways to initialize it(dtype,columns,index)
- shape
- head
- tail
- convert to numpy array --> values
- columns
- to_csv (index = false)
- read_csv
-  drop(columns=[])
-  describe()
-  info()
-  iloc
-  loc
-  Access Particular Columns
-  indexing and slicing --> multirow and col
-  columns.get_loc
-  Fancy indexing
-  Filtering
-  unique
-  sort_values(by,ascending)
-  getdummies 
- groupby --> column name, various functions on grp, iterate
- pivot --> summarize and aggregate data,Grouper
- concat--> give as list, ignore_index,join
- merge--> on,how
- dropna
- fillna
- interpolate
- pip install matplotlib

In [1]:
import pandas as pd
import numpy as np

In [2]:
print(pd.__version__)
pd.DF = pd.DataFrame

2.2.3

In [3]:
l1 = np.array([10,20,30,40,50])

In [4]:
pds = pd.Series(l1,index=['A','B','C','D','Fa'],dtype='f8')

In [5]:
pds

A     10.0
B     20.0
C     30.0
D     40.0
Fa    50.0
dtype: float64

In [6]:
type(pds)

pandas.core.series.Series

In [7]:
pds['A']

np.float64(10.0)

In [8]:
marks = {
    'Phy': np.random.randint(1,101,size=5),
    'Chem': np.random.randint(1,101,size=5),
    'Maths':np.random.randint(1,101,size=5)
}

In [9]:
marks

{'Phy': array([50, 72, 51, 32, 19], dtype=int32),
 'Chem': array([14, 60, 74,  3, 54], dtype=int32),
 'Maths': array([19, 80, 85, 70, 16], dtype=int32)}

In [10]:
df = pd.DataFrame(marks,index=['A','B','C','D','E'])

In [11]:
df

   Phy  Chem  Maths
A   50    14     19
B   72    60     80
C   51    74     85
D   32     3     70
E   19    54     16

In [16]:
df.where(df['Phy'] >= 50)

    Phy  Chem  Maths
A  50.0  14.0   19.0
B  72.0  60.0   80.0
C  51.0  74.0   85.0
D   NaN   NaN    NaN
E   NaN   NaN    NaN

In [42]:
na = np.arange(30).reshape((10,3))

In [49]:
df2 = pd.DF(na,columns=['Physics','Chemistry','Mathematics'])

In [50]:
df2

   Physics  Chemistry  Mathematics
0        0          1            2
1        3          4            5
2        6          7            8
3        9         10           11
4       12         13           14
5       15         16           17
6       18         19           20
7       21         22           23
8       24         25           26
9       27         28           29

In [51]:
df

   Phy  Chem  Maths
A   74    41     65
B   70     9      9
C   63    37     38
D   98    56     56
E   72    48     34

In [52]:
df.shape

(5, 3)

In [55]:
df2.head(3)

   Physics  Chemistry  Mathematics
0        0          1            2
1        3          4            5
2        6          7            8

In [57]:
df2.tail(3)

   Physics  Chemistry  Mathematics
7       21         22           23
8       24         25           26
9       27         28           29

In [58]:
df.values

array([[74, 41, 65],
       [70,  9,  9],
       [63, 37, 38],
       [98, 56, 56],
       [72, 48, 34]], dtype=int32)

In [59]:
df.columns

Index(['Phy', 'Chem', 'Maths'], dtype='object')

In [61]:
df2.columns[0]

'Physics'

In [62]:
df

   Phy  Chem  Maths
A   74    41     65
B   70     9      9
C   63    37     38
D   98    56     56
E   72    48     34

In [63]:
df.to_csv("Marks.csv")

In [66]:
ndf = pd.read_csv("Marks.csv",index_col='Unnamed: 0')

In [67]:
ndf

   Phy  Chem  Maths
A   74    41     65
B   70     9      9
C   63    37     38
D   98    56     56
E   72    48     34

In [73]:
df.to_csv("Marks.csv",sep='|',index=False)

In [74]:
ndf = pd.read_csv("Marks.csv",sep='|')
ndf

   Phy  Chem  Maths
0   74    41     65
1   70     9      9
2   63    37     38
3   98    56     56
4   72    48     34

In [75]:
ndf.index = ['A','B','C','D','E']

In [76]:
ndf

   Phy  Chem  Maths
A   74    41     65
B   70     9      9
C   63    37     38
D   98    56     56
E   72    48     34

In [77]:
df

   Phy  Chem  Maths
A   74    41     65
B   70     9      9
C   63    37     38
D   98    56     56
E   72    48     34

In [82]:
df.drop(['C'],axis = 0,inplace=True)

In [83]:
df

   Phy  Chem  Maths
A   74    41     65
B   70     9      9
D   98    56     56
E   72    48     34

In [84]:
df2

   Physics  Chemistry  Mathematics
0        0          1            2
1        3          4            5
2        6          7            8
3        9         10           11
4       12         13           14
5       15         16           17
6       18         19           20
7       21         22           23
8       24         25           26
9       27         28           29

In [85]:
df2.describe()

         Physics  Chemistry  Mathematics
count  10.000000  10.000000    10.000000
mean   13.500000  14.500000    15.500000
std     9.082951   9.082951     9.082951
min     0.000000   1.000000     2.000000
25%     6.750000   7.750000     8.750000
50%    13.500000  14.500000    15.500000
75%    20.250000  21.250000    22.250000
max    27.000000  28.000000    29.000000

In [86]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Physics      10 non-null     int64
 1   Chemistry    10 non-null     int64
 2   Mathematics  10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

In [93]:
df[['Maths','Phy']]

   Maths  Phy
A     65   74
B      9   70
D     56   98
E     34   72

In [96]:
df.loc[['A','B','E'],['Phy','Maths']]

   Phy  Maths
A   74     65
B   70      9
E   72     34

In [98]:
df.loc['A']['Phy']

np.int32(74)

In [100]:
df.iloc[[1,0,3],[2,0]]

   Maths  Phy
B      9   70
A     65   74
E     34   72

In [101]:
df.iloc[1:3,1:2]

   Chem
B     9
D    56

In [102]:
df.loc['A':'D']

   Phy  Chem  Maths
A   74    41     65
B   70     9      9
D   98    56     56

In [103]:
df.iloc[[True,False,False,True]]

   Phy  Chem  Maths
A   74    41     65
E   72    48     34

In [109]:
df[df['Phy'] >= 73]

   Phy  Chem  Maths
A   74    41     65
D   98    56     56

In [119]:
df.columns

Index(['Phy', 'Chem', 'Maths'], dtype='object')

In [112]:
df.columns.get_loc('Maths')

2

In [113]:
df

   Phy  Chem  Maths
A   74    41     65
B   70     9      9
D   98    56     56
E   72    48     34

In [114]:
df['Phy'].unique()

array([74, 70, 98, 72], dtype=int32)

In [115]:
a = np.array([1,3,1,2,4,1,3,2,4,1,2,3,1,4])

In [117]:
np.unique(a,return_counts=True)

(array([1, 2, 3, 4]), array([5, 3, 3, 3]))

In [120]:
df

   Phy  Chem  Maths
A   74    41     65
B   70     9      9
D   98    56     56
E   72    48     34

In [123]:
df.sort_values(by = 'Phy',axis = 0,ascending=False,)

   Phy  Chem  Maths
D   98    56     56
A   74    41     65
E   72    48     34
B   70     9      9

In [125]:
df.sort_values(by = 'A',axis = 1,ascending=False)

   Phy  Maths  Chem
A   74     65    41
B   70      9     9
D   98     56    56
E   72     34    48

In [126]:
pds = pd.Series(['A','B','C','B','A','B'])

In [127]:
pds

0    A
1    B
2    C
3    B
4    A
5    B
dtype: object

In [134]:
pdd = pd.get_dummies(pds,dtype='i1',prefix='y')

In [135]:
pdd

   y_A  y_B  y_C
0    1    0    0
1    0    1    0
2    0    0    1
3    0    1    0
4    1    0    0
5    0    1    0

In [137]:
data = pd.read_csv("weather_data_cities.csv")

In [138]:
data

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [146]:
data.iloc[data['temperature'].argmax()]

day            1/4/2017
city             mumbai
temperature          92
windspeed             5
event              Rain
Name: 7, dtype: object

In [152]:
data[data['temperature'] == data['temperature'].max()]

        day    city  temperature  windspeed event
7  1/4/2017  mumbai           92          5  Rain

In [160]:
gdf = data.groupby(by = 'city')

In [161]:
for city,group in gdf:
    print(city)
    print(group)
    print()

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [163]:
gdf['temperature'].max()

city
mumbai      92
new york    36
paris       54
Name: temperature, dtype: int64

In [164]:
gdf = data.groupby(by = 'event')
gdf['windspeed'].mean()

event
Cloudy    10.333333
Fog       13.500000
Rain       5.500000
Snow      12.000000
Sunny      9.750000
Name: windspeed, dtype: float64

In [165]:
data

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [166]:
data.pivot(columns='city',index='day')

         temperature                windspeed                 event           \
city          mumbai new york paris    mumbai new york paris mumbai new york
day
1/1/2017          90       32    45         5        6    20  Sunny     Rain
1/2/2017          85       36    50        12        7    13    Fog    Sunny
1/3/2017          87       28    54        15       12     8    Fog     Snow
1/4/2017          92       33    42         5        7    10   Rain    Sunny


city       paris
day
1/1/2017   Sunny
1/2/2017  Cloudy
1/3/2017  Cloudy
1/4/2017  Cloudy

In [179]:
d1 = {
    'A' : [10,20,30,40],
    'B' : [3,4,5,6]
}
d2 = {
    'A' : [30,40,50,60],
    'C' : [3,4,5,6]
}

In [180]:
df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)

In [181]:
df1

    A  B
0  10  3
1  20  4
2  30  5
3  40  6

In [182]:
df2

    A  C
0  30  3
1  40  4
2  50  5
3  60  6

In [187]:
df3 = pd.concat([df1,df2],join='inner',ignore_index=True)
df3

    A
0  10
1  20
2  30
3  40
4  30
5  40
6  50
7  60

In [193]:
mdf3 = pd.merge(df1,df2,how='outer')
mdf3

    A    B    C
0  10  3.0  NaN
1  20  4.0  NaN
2  30  5.0  3.0
3  40  6.0  4.0
4  50  NaN  5.0
5  60  NaN  6.0

In [194]:
mdf3.dropna()

    A    B    C
2  30  5.0  3.0
3  40  6.0  4.0

In [199]:
mdf3.fillna(mdf3.mean())

    A    B    C
0  10  3.0  4.5
1  20  4.0  4.5
2  30  5.0  3.0
3  40  6.0  4.0
4  50  4.5  5.0
5  60  4.5  6.0

In [198]:
mdf3.mean()

A    35.0
B     4.5
C     4.5
dtype: float64

In [209]:
mdf3.interpolate('linear',limit_direction='both')

    A    B    C
0  10  3.0  3.0
1  20  4.0  3.0
2  30  5.0  3.0
3  40  6.0  4.0
4  50  6.0  5.0
5  60  6.0  6.0